hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu2/F2838x_ROM/driverlib/fsi.h
//###########################################################################
//
// FILE:   fsi.h
//
// TITLE:  C28x FSI Driver API header file
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:  $
//###########################################################################

#ifndef FSI_H
#define FSI_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup fsi_api FSI
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_fsi.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"
#include "interrupt.h"

//*****************************************************************************
// FSI Tx defines
//*****************************************************************************

//! \brief FSI Tx events defines
//!
//! \details Values that can be passed to APIs to enable/disable interrupts and
//!          also to set/get/clear event status on FSI Tx operation.
//!
//!          There are 4 supported interrupts related to Tx events-
//!          All are available as event status as well excecpt 4th one.
//!          1) frame transmission done
//!          2) transmit buffer is underrun
//!          3) transmit buffer is overrun
//!          4) ping counter timeout
//!
//!          Ping frame transmission upon hardware trigger(ping watchdog or
//!          external trigger) is shown as event status.
//!
#define FSI_TX_EVT_FRAME_DONE       (0x0001U)
#define FSI_TX_EVT_BUF_UNDERRUN     (0x0002U)
#define FSI_TX_EVT_BUF_OVERRUN      (0x0004U)
#define FSI_TX_EVT_PING_TIMEOUT     (0x0008U)
#define FSI_TX_EVT_PING_HW_TRIG     (0x0008U)

//! \brief Mask of all Tx Events, ORing all event defines
//!
#define FSI_TX_EVTMASK              (0x000FU)

//! \brief Maximum number of external input for triggering frame-transmission
//!
#define FSI_TX_MAX_NUM_EXT_TRIGGERS (0x0020U)

//! \brief Shifts needed to control FSI Tx interrupt generation on INT2
//!
#define FSI_TX_INT2_CTRL_S (0x8U)

//*****************************************************************************
// FSI Rx Defines
//*****************************************************************************

//! \brief FSI Rx event defines
//!
//! \details Values that can be passed to APIs to enable/disable interrupts and
//!          also to set/get/clear event status on FSI Rx operation.
//!
//!          There are 12 supported interrupts related to Rx events-
//!          All are available as event status as well.
//!          1)  ping watchdog times out
//!          2)  frame watchdog times out
//!          3)  mismatch between hardware computed CRC and received CRC.This
//!              status should be ignored if user chooses SW CRC computation
//!          4)  invalid Frame type detected
//!          5)  invalid EndofFrame bit-pattern
//!          6)  buffer Overrun in Rx buffer
//!          7)  received frame without errors
//!          8)  software reads empty Rx buffer
//!          9)  received error frame
//!          10) received ping frame
//!          11) software didn't clear FRAME_DONE flag after receiving new
//!              frame
//!          12) received data frame
//!
#define FSI_RX_EVT_PING_WD_TIMEOUT  (0x0001U)
#define FSI_RX_EVT_FRAME_WD_TIMEOUT (0x0002U)
#define FSI_RX_EVT_CRC_ERR          (0x0004U)
#define FSI_RX_EVT_TYPE_ERR         (0x0008U)
#define FSI_RX_EVT_EOF_ERR          (0x0010U)
#define FSI_RX_EVT_OVERRUN          (0x0020U)
#define FSI_RX_EVT_FRAME_DONE       (0x0040U)
#define FSI_RX_EVT_UNDERRUN         (0x0080U)
#define FSI_RX_EVT_ERR_FRAME        (0x0100U)
#define FSI_RX_EVT_PING_FRAME       (0x0200U)
#define FSI_RX_EVT_FRAME_OVERRUN    (0x0400U)
#define FSI_RX_EVT_DATA_FRAME       (0x0800U)

//! \brief Mask of all Rx Events, ORing all event defines
//!
#define FSI_RX_EVTMASK              (0x0FFFU)

//! \brief Maximum value in Rx delay line tap control
//!
#define FSI_RX_MAX_DELAY_LINE_VAL   (0x001FU)

//*****************************************************************************
// Common defines for both FSI Tx and Rx
//*****************************************************************************

//! \brief Maximum data length(16 words) for user/software defined data frame
//!
#define FSI_MAX_LEN_NWORDS_DATA     (0x000FU)

//! \brief Maximum value for user data field(8 bits)
//!
#define FSI_MAX_VALUE_USERDATA      (0x00FFU)

//! \brief Maximum value of Buffer pointer offset(4 bits)
//!
#define FSI_MAX_VALUE_BUF_PTR_OFF   (0x000FU)

//! \brief Key value for writing some FSI Tx/Rx registers
//!
#define FSI_CTRL_REG_KEY            (0x00A5U)

//*****************************************************************************
// typedefs
//*****************************************************************************
//! \brief Data lines used for transmit/receive operation
//!
//! \details Supported number of data lines is only 2 - 1 lane or 2 lanes
//!
typedef enum
{
    FSI_DATA_WIDTH_1_LANE = 0x0000U,
    FSI_DATA_WIDTH_2_LANE = 0x0001U
} FSI_DataWidth;

//! \brief List of TX submodules that can be reset, can be used with reset APIs
//!
//! \details Three kind of resets can be made-
//!          1) reset entire Tx Module
//!          2) reset only TX clock
//!          3) reset ping timeout counter
//!
typedef enum
{
    FSI_TX_MASTER_CORE_RESET      = 0x0000U,
    FSI_TX_CLOCK_RESET            = 0x0001U,
    FSI_TX_PING_TIMEOUT_CNT_RESET = 0x0002U
} FSI_TxSubmoduleInReset;

//! \brief Start Mode for Tx frame transmission
//!
//! \details Three start modes(i.e. how transmission will start) are supported-
//!          1. SW write of START bit in \b TX_PKT_CTRL register
//!          2. Rising edge on external trigger
//!          3. Either SW write of START bit or Frame completion
//!
typedef enum
{
 FSI_TX_START_FRAME_CTRL               = 0x0000U,
 FSI_TX_START_EXT_TRIG                 = 0x0001U,
 FSI_TX_START_FRAME_CTRL_OR_UDATA_TAG  = 0x0002U
} FSI_TxStartMode;

//! \brief Various FSI frame types
//!
//! \details Three frame types exist-
//!          - \b Ping: Used for checking line integrity, can be sent by
//!                     software or automatically by hardware.
//!          - \b Error: Used typically during error conditions or when one
//!                      side wants to signal the other side for attention.
//!          - \b Data: Two subtypes exist based on data-length-
//!                     a) \b Fixed (1/2/4/6 words)
//!                     b) \b Nwords Software programs number of data words
//!
//!  \note 4 bit code for frame types- 0x1, 0x2 and 0x8 to 0xE are reserved
//!
typedef enum
{
    FSI_FRAME_TYPE_PING       = 0x0000U,
    FSI_FRAME_TYPE_ERROR      = 0x000FU,
    FSI_FRAME_TYPE_1WORD_DATA = 0x0004U,
    FSI_FRAME_TYPE_2WORD_DATA = 0x0005U,
    FSI_FRAME_TYPE_4WORD_DATA = 0x0006U,
    FSI_FRAME_TYPE_6WORD_DATA = 0x0007U,
    FSI_FRAME_TYPE_NWORD_DATA = 0x0003U
} FSI_FrameType;

//! \brief Possible values of a FSI frame
//!
//! \details 4 bit field inside FSI frame is available to set tag value(0-15)
//!
typedef enum
{
    FSI_FRAME_TAG0  = 0x0000U,
    FSI_FRAME_TAG1  = 0x0001U,
    FSI_FRAME_TAG2  = 0x0002U,
    FSI_FRAME_TAG3  = 0x0003U,
    FSI_FRAME_TAG4  = 0x0004U,
    FSI_FRAME_TAG5  = 0x0005U,
    FSI_FRAME_TAG6  = 0x0006U,
    FSI_FRAME_TAG7  = 0x0007U,
    FSI_FRAME_TAG8  = 0x0008U,
    FSI_FRAME_TAG9  = 0x0009U,
    FSI_FRAME_TAG10 = 0x000AU,
    FSI_FRAME_TAG11 = 0x000BU,
    FSI_FRAME_TAG12 = 0x000CU,
    FSI_FRAME_TAG13 = 0x000DU,
    FSI_FRAME_TAG14 = 0x000EU,
    FSI_FRAME_TAG15 = 0x000FU
} FSI_FrameTag;

//! \brief Ping timeout mode
//!
//! \details Ping timeout can reset and restart only on hardware initiated PING
//!          frames (PING Watchdog timeout)
//!          OR
//!          on any software initiated frame being sent out also based on
//!          which mode is selected
//!
typedef enum
{
    FSI_PINGTIMEOUT_ON_HWINIT_PING_FRAME   = 0x0000U,
    FSI_PINGTIMEOUT_ON_HWSWINIT_PING_FRAME = 0x0001U
} FSI_PingTimeoutMode;

//! \brief ECC Computation width- 16 bit or 32 bit
//!
typedef enum
{
    FSI_32BIT_ECC_COMPUTE = 0x0000U,
    FSI_16BIT_ECC_COMPUTE = 0x0001U
} FSI_ECCComputeWidth;

//! \brief Interrupt lines supported in FSI
//!
//! \details Any event on FSI Tx or Rx can be enabled to trigger interrupt on 2
//!          interrupt lines to CPU/CLA- \b INT1 and \b INT2
//!
typedef enum
{
    FSI_INT1 = 0x0000U,
    FSI_INT2 = 0x0001U
} FSI_InterruptNum;

//! \brief List of RX modules that can be reset, can be used with reset APIs
//!
//! \details Three submodules can be reset-
//!          1) RX master core
//!          2) frame watchdog counter
//!          3) ping watchdog counter
//!
typedef enum
{
    FSI_RX_MASTER_CORE_RESET  = 0x0000U,
    FSI_RX_FRAME_WD_CNT_RESET = 0x0001U,
    FSI_RX_PING_WD_CNT_RESET  = 0x0002U
} FSI_RxSubmoduleInReset;

//! \brief Available Rx lines for delay tap selection
//!
//! \details Delay tapping can be done on 3 lines- 1)RXCLK 2)RXD0 and 3)RXD1
//!
typedef enum
{
    FSI_RX_DELAY_CLK = 0x0000U,
    FSI_RX_DELAY_D0  = 0x0001U,
    FSI_RX_DELAY_D1  = 0x0002U
} FSI_RxDelayTapType;

//! \brief Indexes of available EPWM SOC triggers
//!
//! \details There are 16 ePWM SOC events as external triggers for FSI frame
//!          transfers. Indexes 0:7 and 24:31 are reserved out of total 32
//!          muxed external triggers.
//!
typedef enum
{
    FSI_EXT_TRIGSRC_EPWM1_SOCA = 8,
    FSI_EXT_TRIGSRC_EPWM1_SOCB,
    FSI_EXT_TRIGSRC_EPWM2_SOCA,
    FSI_EXT_TRIGSRC_EPWM2_SOCB,
    FSI_EXT_TRIGSRC_EPWM3_SOCA,
    FSI_EXT_TRIGSRC_EPWM3_SOCB,
    FSI_EXT_TRIGSRC_EPWM4_SOCA,
    FSI_EXT_TRIGSRC_EPWM4_SOCB,
    FSI_EXT_TRIGSRC_EPWM5_SOCA,
    FSI_EXT_TRIGSRC_EPWM5_SOCB,
    FSI_EXT_TRIGSRC_EPWM6_SOCA,
    FSI_EXT_TRIGSRC_EPWM6_SOCB,
    FSI_EXT_TRIGSRC_EPWM7_SOCA,
    FSI_EXT_TRIGSRC_EPWM7_SOCB,
    FSI_EXT_TRIGSRC_EPWM8_SOCA,
    FSI_EXT_TRIGSRC_EPWM8_SOCB
} FSI_ExtFrameTriggerSrc;

//*****************************************************************************
// FSI Tx function prototypes/defintion
//*****************************************************************************

//*****************************************************************************
//
//! \brief Validates if FSI-Tx base address is correct
//!
//! \param[in] base is the base address of the FSI-Tx module
//!
//! \return returns \b true if the base address is valid and \b false otherwise
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
FSI_isTxBaseValid(uint32_t base)
{
      return((base == FSITXA_BASE) || (base == FSITXB_BASE));
    
